package cn.don9cn.blog.autoconfigs.websocket.chatroom.util;

import java.util.Random;

/**
 * @Author: liuxindong
 * @Description: 随机生成聊天室的用户名
 * @Create: 2017/10/23 15:07
 * @Modify:
 */
public class RandomNameUtil {

    private static Random random = new Random();

    public enum  RandomName{
        N1("九纹龙"),N2("神机军师"),N3("跳涧虎"),N4("白花蛇"),N5("花和尚"),N6("打虎将"),N7("小霸王"),N8("豹子头"),N9("小旋风"),N10("旱地忽律"),
        N11("摸着天"),N12("活阎王"),N13("毛头星"),N14("石将军"),N15("催命判官"),N16("小遮拦"),N17("神行太保"),N18("黑旋风"),N19("圣手书生"),N20("浪里白条"),
        N21("云里金刚"),N22("入云龙"),N23("独火星"),N24("混江龙"),N25("船伙儿"),N26("玉臂匠"),N27("摩云金"),N28("神算子"),N29("铁笛仙"),N30("九尾龟"),
        N31("青面兽"),N32("白日鼠"),N33("锦毛虎"),N34("出洞蛟"),N35("没遮拦"),N36("通臂猿"),N37("笑面虎"),N38("青眼虎"),N39("锦豹子"),N40("火眼猊"),
        N41("急先锋"),N42("操刀鬼"),N43("矮脚虎"),N44("翻江蜃"),N45("病大虫"),N46("玉幡竿"),N47("铁面孔目"),N48("病关索"),N49("拼命三郎"),N50("鼓上蚤"),
        N51("美髯公"),N52("及时雨"),N53("白面郎君"),N54("鬼脸儿"),N55("一丈青"),N56("双鞭"),N57("金枪将"),N58("混世魔王"),N59("飞天大圣"),N60("金毛犬"),
        N61("插翅虎"),N62("铁扇子"),N63("小李广"),N64("扑天雕"),N65("铁叫子"),N66("百胜将军"),N67("玉麒麟"),N68("铁臂膊"),N69("丑郡马"),N70("一枝花"),
        N71("赤发鬼"),N72("行者"),N73("镇三山"),N74("双尾蝎"),N75("出林龙"),N76("轰天雷"),N77("浪子"),N78("大刀"),N79("井木犴"),N80("活闪婆"),
        N81("智多星"),N82("菜园子"),N83("霹雳火"),N84("两头蛇"),N85("金钱豹子"),N86("天目将军"),N87("神医"),N88("没面目"),N89("圣水将军"),N90("神火将军"),
        N91("立地太岁"),N92("母夜叉"),N93("小温侯"),N94("小尉迟"),N95("母大虫"),N96("八臂哪吒"),N97("险道神"),N98("双枪将"),N99("没羽箭"),N100("中箭虎"),
        N101("短命二郎"),N102("金眼彪"),N103("赛仁贵"),N104("独角龙"),N105("病尉迟"),N106("丧门神"),N107("花项虎"),N108("紫髯伯");
        private final String name;

        RandomName(String name){
            this.name = name;
        }
    }

    public static String get(){
        RandomName[] names = RandomName.values();
        return names[random.nextInt(names.length-1)].name;
    }

}
